<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #15 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347986521","plan_hash":"c328f8fc5670b17685bb4cf00f78b1c4b2fbdc79fdd884a0b92a88902246b7bb","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be created
+   resource "aws_acm_certificate" "cert" {
+       arn                       = (known after apply)
+       domain_name               = "test.fastapi.dennisowie.com"
+       domain_validation_options = (known after apply)
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "test.fastapi.dennisowie.com",
        ]
+       tags_all                  = {
+           "Environment" = "Dev Environment"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "EMAIL"
    }

  # aws_lb_listener.listerner_443 will be created
+   resource "aws_lb_listener" "listerner_443" {
+       arn               = (known after apply)
+       certificate_arn   = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-2016-08"
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev-443/4c3e823ca057454b"
+           type             = "forward"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #15](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7347986521)